{
  "@context": [
        "textannodata.jsonld",
        "skos.jsonld"
  ],
  "n": {
      "@id": "tad:n",
      "@type": "rdf:Property",
      "label": "number",
      "description": "Sequence number",
      "sameAs": ["tei:n", "folia:NAttribute"]
  },
  "style": {
      "@id": "tad:style",
      "@type": "rdf:Property",
      "label": "style",
      "description": "Encodes the rendition style of a piece of text. The vocabulary is open-ended and may contain terms as 'italic', 'bold','underlined', common color names (red,blue,green) or #rrggbb color codes. This property is expected on Highlight annotations."
  },
  "elementName": {
      "@id": "tad:style",
      "@type": "rdf:Property",
      "label": "elementName",
      "description": "The original element name from the source XML data. This property is mainly for provenance reasons and should be used as little as possible, rely on rdf:type instead."
  },
  "subtitle": {
      "@id": "tad:subtitle",
      "@type": "rdf:Property",
      "label": "subtitle",
      "description": "A secondary title"
  },
  "subtype": {
      "@id": "tad:subtype",
      "@type": "rdf:Property",
      "label": "subtype",
      "description": "A secondary type. Whereas the rdf:type expresses a primary type, this expresses a subordinate type for the given rdf:type. It is useful in cases where you want to explicitly make the subordinate relation clear or want to avoid having multiple rdf types."
  },
  "isTextPrefix": {
      "@id": "tad:isTextPrefix",
      "@type": "rdf:Property",
      "label": "isTextPrefix",
      "description": "This boolean property marks a portion of a text as being a generated prefix, this means that this part of the plain text was generated and does not correspond verbatim to the representation in the source but is a best-effort rendering in a given context."
  },
  "isTextSuffix": {
      "@id": "tad:isTextSuffix",
      "@type": "rdf:Property",
      "label": "isTextSuffix",
      "description": "This boolean property marks a portion of a text as being a generated suffix, this means that this part of the plain text was generated and does not correspond verbatim to the representation in the source but is a best-effort rendering in a given context."
  },
  "NormalText": {
      "@id": "tad:NormalText",
      "@type": "Concept",
      "prefLabel": "NormalText",
      "definition": "This class is used on web annotation targets and indicates that the referenced text is in a form considered the normal form for a particular dataset. This means that text may have been dehyphenated and linebreaks removed (if this was needed). The precise nature of the normalization is not strictly defined but must be consistent within a dataset. It is contrasted to OriginalText.",
      "broader": "dcterms:Text"
  },
  "OriginalText": {
      "@id": "tad:OriginalText",
      "@type": "Concept",
      "prefLabel": "OriginalText",
      "definition": "This class is used on web annotation targets and indicates that the referenced text is in an original form prior to any (further unspecified) normalization deemed necessary for the dataset. It is contrasted to NormalText.",
      "broader": "dcterms:Text"
  }
}
